source/_posts/2014-05-10-clojure-recursion.html
---
title: "Clojure 遞迴測試"
date: 2014-05-10
layout: post
categories: clojure
published: true
comments: true
---
<p>
<a href="http://clojure.org/functional_programming#Functional%2520Programming--Recursive%2520Looping">Clojure Recursive Looping</a>
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">傳統遞迴</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Source</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #268bd2;">deepable-recur?</span> [deep-length]
  (<span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #839496; font-weight: bold;">=</span> 0 deep-length)
    true
    (deepable-recur? (<span style="color: #839496; font-weight: bold;">dec</span> deep-length))))
</pre>
</div>

<p>
<!-- more -->
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Test</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>一個很蠢的測試函式：
</li>
</ul>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #268bd2;">deep-test</span> [start end step deep-fn]
  (<span style="color: #859900; font-weight: bold;">doseq</span> [length (<span style="color: #839496; font-weight: bold;">range</span> start end step)]
    (<span style="color: #859900; font-weight: bold;">if</span> (deep-fn length)
      (<span style="color: #839496; font-weight: bold;">println</span> length <span style="color: #2aa198;">"Deep Done!"</span>))))
(deep-test 5000 10000 1000 deepable-recur?)
<span style="color: #586e75;">;;; </span><span style="color: #586e75;">output-&gt;</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">5000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">6000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">7000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">8000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">StackOverflowError   clojure.lang.Numbers$LongOps.combine (Numbers.java:394)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Clojure recur special operator</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Source</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #268bd2;">deepable-recur?</span> [deep-length]
  (<span style="color: #859900; font-weight: bold;">loop</span> [len deep-length]
    (<span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #839496; font-weight: bold;">=</span> 0 len)
      true
      (<span style="color: #859900; font-weight: bold;">recur</span> (<span style="color: #839496; font-weight: bold;">dec</span> len)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Test</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-clojure">(deep-test 60000000 80000000 2000000 deepable-recur?)
<span style="color: #586e75;">;;; </span><span style="color: #586e75;">output-&gt;</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">60000000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">62000000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">64000000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">66000000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">68000000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">70000000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">72000000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">74000000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">76000000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">78000000 Deep Done!</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">nil</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Clojure trampoline</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Source</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #268bd2;">deepable-recur?</span> [deep-length]
  (<span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #839496; font-weight: bold;">=</span> 0 deep-length)
    true
    #(deepable-recur? (<span style="color: #839496; font-weight: bold;">dec</span> deep-length))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Test</h3>
<div class="outline-text-3" id="text-3-2">
<p>
比上面那個慢多了。
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #839496; font-weight: bold;">trampoline</span> deepable-recur? 70000000)
<span style="color: #586e75;">;;; </span><span style="color: #586e75;">output-&gt;</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">true</span>
</pre>
</div>
</div>
</div>
</div>
